testing/results/llm_d_kimivla3b_1agg_4e1pd_4img_matrix_super21_intel02_20260714_074711_n128/smoke/r1.0/4e1pd/docker_bench_4e1pd_r1.0.log
/opt/sglang/python/sglang/srt/layers/attention/fla/utils.py:223: UserWarning: Triton is not supported on current platform, roll back to CPU.
  warnings.warn(
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
[transformers] `KimiVLProcessor` defines `image_processor_class = 'AutoImageProcessor'`, which is deprecated. Register the correct mapping in `AutoImageProcessor` instead.
benchmark_args=Namespace(backend='sglang-oai-chat', base_url=None, host='127.0.0.1', port=8000, ready_check_timeout_sec=0, dataset_name='image', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='/mnt/weka/data/llm-d-models-pv/hub/models--moonshotai--Kimi-VL-A3B-Instruct/snapshots/main', served_model_name='moonshotai/Kimi-VL-A3B-Instruct', tokenizer=None, num_prompts=1, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=16, random_range_ratio=0.0, image_count=4, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=1.0, use_trace_timestamps=False, max_concurrency=8, output_file='/results/llm_d_kimivla3b_1agg_4e1pd_4img_matrix_super21_intel02_20260714_074711_n128/smoke/r1.0/4e1pd/bench_4e1pd_r1.0.json', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=0, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Namespace(backend='sglang-oai-chat', base_url=None, host='127.0.0.1', port=8000, ready_check_timeout_sec=0, dataset_name='image', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='/mnt/weka/data/llm-d-models-pv/hub/models--moonshotai--Kimi-VL-A3B-Instruct/snapshots/main', served_model_name='moonshotai/Kimi-VL-A3B-Instruct', tokenizer=None, num_prompts=1, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=16, random_range_ratio=0.0, image_count=4, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=1.0, use_trace_timestamps=False, max_concurrency=8, output_file='/results/llm_d_kimivla3b_1agg_4e1pd_4img_matrix_super21_intel02_20260714_074711_n128/smoke/r1.0/4e1pd/bench_4e1pd_r1.0.json', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=0, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 4217
#Output tokens: 16
#Total images: 4
#Images per request: 4 (fixed)

=== Token Breakdown (per request avg / total) ===
  Raw text prompt tokens (without overhead): avg=45.0, total=45
  Text prompt tokens (with chat template): avg=61.0, total=61
  Text prompt overhead: avg=16.0, total=16
  Vision tokens: avg=4156.0, total=4156

Created 1 random jpeg images with average 8359480 bytes per request
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    1.0       
Max request concurrency:                 8         
Successful requests:                     1         
Benchmark duration (s):                  2.54      
Total input tokens:                      4217      
Total input text tokens:                 61        
Total input vision tokens:               4156      
Total generated tokens:                  16        
Total generated tokens (retokenized):    16        
Request throughput (req/s):              0.39      
Input token throughput (tok/s):          1662.21   
Output token throughput (tok/s):         6.31      
Peak output token throughput (tok/s):    11.00     
Peak concurrent requests:                1         
Total token throughput (tok/s):          1668.52   
Concurrency:                             0.99      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   2516.06   
Median E2E Latency (ms):                 2516.06   
P90 E2E Latency (ms):                    2516.06   
P99 E2E Latency (ms):                    2516.06   
---------------Time to First Token----------------
Mean TTFT (ms):                          1797.81   
Median TTFT (ms):                        1797.81   
P99 TTFT (ms):                           1797.81   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          47.88     
Median TPOT (ms):                        47.88     
P99 TPOT (ms):                           47.88     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           47.88     
Median ITL (ms):                         50.11     
P95 ITL (ms):                            52.98     
P99 ITL (ms):                            53.28     
Max ITL (ms):                            53.35     
==================================================
wrote /results/llm_d_kimivla3b_1agg_4e1pd_4img_matrix_super21_intel02_20260714_074711_n128/smoke/r1.0/4e1pd